Revit 2026 API

# FabricationServiceButtonGetConditionImage Method

---

Gets the image for the specified fabrication service button condition.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual Bitmap GetConditionImage(
	int condition
)
```
```vb
Public Overridable Function GetConditionImage (
	condition As Integer
) As Bitmap
```
```cpp
public:
virtual Bitmap^ GetConditionImage(
	int condition
)
```
```fsharp
abstract GetConditionImage :
        condition : int -> Bitmap
override GetConditionImage :
        condition : int -> Bitmap
```

#### Parameters

condition Int32
    The condition index.

#### Return Value

BitmapSystem.Drawing.Bitmap represents the fabrication service button image.  if there is no preview image.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | the index condition is not larger or equal to 0 and less than ConditionCount |

#### Reference

FabricationServiceButton Class

Autodesk.Revit.DB Namespace